In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("resumes.csv")
data.head()

   Resume_ID                                        Resume_Text
0          1  data analyst with experience in excel, python,...
1          2  software engineer with experience in pandas, e...
2          3  machine learning engineer with experience in m...
3          4  software engineer with experience in javascrip...
4          5  frontend developer with experience in deep lea...

In [3]:
data['clean_resume'] = data['Resume_Text']

In [4]:
data['clean_resume'] = data['clean_resume'].fillna("").astype(str)

In [5]:
data['clean_resume'] = data['clean_resume'].str.lower()

In [6]:
data['clean_resume'] = data['clean_resume'].str.replace('[^a-z ]', '', regex=True)

In [7]:
from nltk.corpus import stopwords

stop_words = set(stopwords.words('english'))

def remove_stopwords(text):
    words = text.split()
    cleaned = []
    for word in words:
        if word not in stop_words:
            cleaned.append(word)
    return " ".join(cleaned)

data['clean_resume'] = data['clean_resume'].apply(remove_stopwords)

In [8]:
data[['Resume_Text', 'clean_resume']].head()

,Resume_Text,clean_resume
0,"data analyst with experience in excel, python,...",data analyst experience excel python pandas po...
1,"software engineer with experience in pandas, e...",software engineer experience pandas excel java...
2,machine learning engineer with experience in m...,machine learning engineer experience mysql pow...
3,software engineer with experience in javascrip...,software engineer experience javascript deep l...
4,frontend developer with experience in deep lea...,frontend developer experience deep learning nu...

In [9]:
job_role = "Data Scientist"

In [10]:
job_skills = [
    "python",
    "machine learning",
    "pandas",
    "numpy",
    "sql"
]

In [11]:
def extract_skills(text):
    matched = []
    for skill in job_skills:
        if skill in text:
            matched.append(skill)
    return matched

In [12]:
data['matched_skills'] = data['clean_resume'].apply(extract_skills)

In [13]:
data['score'] = data['matched_skills'].apply(len)

In [14]:
def find_missing_skills(matched):
    return list(set(job_skills) - set(matched))

data['missing_skills'] = data['matched_skills'].apply(find_missing_skills)

In [15]:
ranked_candidates = data.sort_values(by='score', ascending=False)

In [16]:
ranked_candidates[['Resume_ID', 'matched_skills', 'missing_skills', 'score']].head(10)

,Resume_ID,matched_skills,missing_skills,score
616,617,"[python, machine learning, pandas, numpy, sql]",[],5
248,249,"[python, machine learning, pandas, numpy, sql]",[],5
917,918,"[python, machine learning, pandas, numpy, sql]",[],5
111,112,"[python, machine learning, pandas, numpy, sql]",[],5
388,389,"[python, machine learning, numpy, sql]",[pandas],4
7,8,"[machine learning, pandas, numpy, sql]",[python],4
387,388,"[machine learning, pandas, numpy, sql]",[python],4
38,39,"[machine learning, pandas, numpy, sql]",[python],4
412,413,"[python, pandas, numpy, sql]",[machine learning],4
416,417,"[python, machine learning, pandas, sql]",[numpy],4

In [ ]:
## Result
Resumes are screened by matching required job skills.
Each resume is scored based on matched skills.
Candidates are ranked, and missing skills are identified.